In [3]:
import pandas as pd
import numpy as np

In [5]:
df = pd.read_csv("./wages.csv")
df.head(5)

           earn  height     sex   race  ed  age
0  79571.299011   73.89    male  white  16   49
1  96396.988643   66.23  female  white  16   62
2  48710.666947   63.77  female  white  16   33
3  80478.096153   63.22  female  other  16   95
4  82089.345498   63.08  female  white  17   43

In [9]:
df[['earn', 'sex']][:3]

           earn     sex
0  79571.299011    male
1  96396.988643  female
2  48710.666947  female

In [4]:
df.sex.unique()

array(['male', 'female'], dtype=object)

In [6]:
df["sex_code"] = df.sex.map({"male": 0, "female": 1})
df.head(5)

           earn  height     sex   race  ed  age  sex_code
0  79571.299011   73.89    male  white  16   49         0
1  96396.988643   66.23  female  white  16   62         1
2  48710.666947   63.77  female  white  16   33         1
3  80478.096153   63.22  female  other  16   95         1
4  82089.345498   63.08  female  white  17   43         1

In [18]:
df.sex.replace(
        {"male":0, "female":1}
).head(5)

0    0
1    1
2    1
3    1
4    1
Name: sex, dtype: int64

In [20]:
df.sex.replace(
        ["male", "female"], [0, 1], inplace=True)
df.head(5)

           earn  height  sex   race  ed  age
0  79571.299011   73.89    0  white  16   49
1  96396.988643   66.23    1  white  16   62
2  48710.666947   63.77    1  white  16   33
3  80478.096153   63.22    1  other  16   95
4  82089.345498   63.08    1  white  17   43

In [24]:
df_info = df[["earn", "height", "age"]]
df_info.head(5)

           earn  height  age
0  79571.299011   73.89   49
1  96396.988643   66.23   62
2  48710.666947   63.77   33
3  80478.096153   63.22   95
4  82089.345498   63.08   43

In [26]:
f = lambda x: x.max() - x.min()
df_info.apply(f) #각각의 Series를 함수에 통째로 넣어버림. 즉 적용된 함수의 매개변수가 Series인것. 그렇기에 반환값도 Series

earn      318047.708444
height        19.870000
age           73.000000
dtype: float64

In [28]:
df_info.sum() #내장함수. 반환값은 Series

earn      4.474344e+07
height    9.183125e+04
age       6.250800e+04
dtype: float64

In [32]:
df_info.apply(sum)

earn      4.474344e+07
height    9.183125e+04
age       6.250800e+04
dtype: float64

In [34]:
df.describe()

                earn       height           ed          age
count    1379.000000  1379.000000  1379.000000  1379.000000
mean    32446.292622    66.592640    13.354605    45.328499
std     31257.070006     3.818108     2.438741    15.789715
min       -98.580489    57.340000     3.000000    22.000000
25%     10538.790721    63.720000    12.000000    33.000000
50%     26877.870178    66.050000    13.000000    42.000000
75%     44506.215336    69.315000    15.000000    55.000000
max    317949.127955    77.210000    18.000000    95.000000

In [36]:
df.sum(axis=0)

earn                                            4.47434e+07
height                                              91831.3
sex       malefemalefemalefemalefemalefemalefemalemalema...
race      whitewhitewhiteotherwhitewhitewhitewhitehispan...
ed                                                    18416
age                                                   62508
dtype: object

In [39]:
df.sum(axis=1)

0        79710.189011
1        96541.218643
2        48823.436947
3        80652.316153
4        82212.425498
5        15422.882901
6        47230.711821
7        51100.344282
8         3324.889556
9        43111.037884
10       10483.838843
11        1133.457155
12       47714.929864
13       19130.622299
14       20195.856639
15        1095.892346
16       36093.181123
17       27072.613964
18       64717.223972
19       70124.713070
20        1101.298306
21       12267.022115
22       84348.157919
23        9079.644935
24       23380.363278
25        8856.809185
26       64716.549805
27       54212.504945
28       17009.860044
29           8.749721
            ...
1349     64752.641872
1350     16059.423155
1351     25480.928379
1352     18610.227184
1353     26560.776457
1354     28757.820098
1355     20174.062736
1356      6463.932127
1357     95549.526798
1358     68564.843058
1359     50418.021292
1360     80646.389376
1361     44035.074343
1362     47859.290935
1363     19293.867431
1364      1115.275131
1365     32911.421176
1366     25001.493294
1367     40879.105077
1368      4321.412685
1369      4867.676508
1370    176037.353598
1371     87635.788778
1372     92350.216106
1373     17031.637851
1374     30290.060363
1375     25018.829514
1376     13823.311312
1377     95563.664410
1378      9686.681857
Length: 1379, dtype: float64

In [43]:
df.earn.mean()

32446.292621754747